package players;

public class Boss extends GameEnitity {
     public Boss(int health, int damage) {
        super(health, damage);
    }
// хотел добавить способность "Золотой щит ". Все записал все готово было, изменил GameEnitity на Hero, все было гладко
//пока не появилась одна мальенкая ошибка изза которой, я думал что код был не правильным и удалил. Но потом окозалось
// что ошибка в одной скобке! и поскольку я безвозвратно удалил коды тяжело было вспоминать да и лень было
// увеличил макс ХР и макс урон, наслаждайтесь!

}
